---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientNoiseSize
source: html/0083cc42-0897-f28e-1ded-49863ab428a1.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientNoiseSize Property

The property labeled "Size" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientNoiseSize { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".